#Область ПрограммныйИнтерфейс
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Формы.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппуШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Формы.ФормаДокумента" Тогда
		ВставитьКонтактноеЛицоНаФормуПослеДоговораПередОснованием(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Формы.ФормаДокумента" Тогда
		ВставитьКонтактноеЛицоНаФормуПослеДоговораПередСуммойДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Формы.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппуШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Формы.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппуШапкаПраво(Форма);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс
Процедура ДобавитьКонтактноеЛицоВГруппуШапкаПраво(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ВставитьКонтактноеЛицоНаФормуПослеДоговораПередОснованием(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.Основание);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ВставитьКонтактноеЛицоНаФормуПослеДоговораПередСуммойДокумента(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	
КонецПроцедуры
#КонецОбласти